ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/RS485Alt1.c

/****************************************************************************************
/ Uart communication to external ADcards
/
***************************************************************************************/

#include "iom1281.h"
#include "stdio.h"
#include "math.h"
#include "externals.h"
#include "version.h"

#define MAX_TIME_BETWEEN_BYTE	100
#if USE_MODBUS_PROTOCOL == 1
    #include "common_def.h"

#endif /* USE_MODBUS_PROTOCOL == 1 */


/************************************************ *************************
*   (This is a timer calback)
*  Timout timer UART 0
*
*************************************************************************/
void TimoutUART0(void) {

    U0_MCR &= ~RTS;      // set RTS off
}

/*************************************************************************
*   (This is a timer calback)
*  Timout timer UART 1
*
*************************************************************************/
void TimoutUART1(void) {

    U1_MCR &= ~RTS;       // set RTS off
}


/*************************************************************************
*   (This is a task)
*  Usart handler UART send request
*
*************************************************************************/
#pragma diag_suppress=Pa082
void ExtRS485Ctl(void) {
    TData.RS4.PortUsed = ReadEEPROMByte(EEPROM_PORTSETUP);   // Get setup from EEPROM
    TData.RS4.SensorType[0] = ReadEEPROMByte(EEPROM_PORTSETUP + 1);
    TData.RS4.SensorType[1] = ReadEEPROMByte(EEPROM_PORTSETUP + 2);

    TData.RS4.ToTargetBuffer[0][0] = false;
    TData.RS4.ToTargetBuffer[1][0] = false;
    TData.RS4.FromTargetBuffer[0][0] = false;
    TData.RS4.FromTargetBuffer[1][0] = false;


    for (char i = 0; i < 8; i++) {
        SetBit(PORTC, (TData.RS4.PortUsed & (0x01 << i)));      // Switch on power
        OS_Delay(100);
    }
    OS_Delay(UART_START_DELAY);                               // Waiting for target startup

    EmptyRxBuf16552(0);                            // Empty UART channel 0
    EmptyRxBuf16552(1);                            // Empty UART channel 0

    while (1) {
        for (PortPair = 0; PortPair < 4; PortPair++) {        // loop through all ports
            if (UART16552[0].RxFaultCnt > MAX_16552_FAIL) {
                EmptyRxBuf16552(0);                            // Empty UART channel 0
            }
            if (UART16552[1].RxFaultCnt > MAX_16552_FAIL) {
                EmptyRxBuf16552(1);                            // Empty UART channel 1
            }
            if (PowerOnTimer < POWER_ON_CNT) {
                if (++PowerOnTimer >= POWER_ON_CNT) {          // check if time to switch on power
                    SetRS4Port();                                // and set power on ports
                }
            }
            SetBit(PORTE, 0xf0);
            ClrBit(PORTE, 0x10 << PortPair);           // set mux port

            // Wait for all events
            char EventStatus = OS_WaitEventTimed(0x03, 1000);              // Wait for ready to send next for both channels
            if (EventStatus & 0x03) {
                if (PowerOnTimer >= POWER_ON_CNT) {
                    PowerOnTimer = 0;                              // and start over again
                }
            }else{
                OS_Delay(0);
            }
        }
    }
}

void SendRequestToExtDevice(char Ch){
    static char SeqCnt = 0;
    static char PowerOnTimer = POWER_ON_CNT;                    // do not make a unwanted power on sequence in the starting phase
    char EventStatus;
    char AskMD[2];



    TData.RS4.PortUsed = ReadEEPROMByte(EEPROM_PORTSETUP);   // Get setup from EEPROM
    TData.RS4.SensorType[0] = ReadEEPROMByte(EEPROM_PORTSETUP + 1);
    TData.RS4.SensorType[1] = ReadEEPROMByte(EEPROM_PORTSETUP + 2);
#if USE_MODBUS_PROTOCOL == 1
    {
        static void load_eeprom_misc_485(void);
        load_eeprom_misc_485();
    }
#endif

    TData.RS4.ToTargetBuffer[0][0] = false;
    TData.RS4.ToTargetBuffer[1][0] = false;
    TData.RS4.FromTargetBuffer[0][0] = false;
    TData.RS4.FromTargetBuffer[1][0] = false;



            if ((TData.RS4.PortUsed >> PortPair) & 0x01) {      // sensor on port 0?
                UART16552[0].TxFirst = 6;                       // Start packet build at pos.
                char SnsType = (TData.RS4.SensorType[0] >> (2 * PortPair)) & 0x3;
                switch (SnsType) {
                case 0x01:    //Water ingress??
                    switch (SeqCnt) {
                    case 0:
                        Uart_BuildReqWISCardStatus(0);          //Card status
                        break;
                    case 20:
                        if ((TData.RS4.FromTargetBuffer[0][0] == false) && (TData.RS4.EEPROMPortPair[0] == PortPair)) { // buffer ready
                            Uart_BuildReqWISXData(0, 115);            // Request serial no
                            if (++TData.RS4.EEPROMPortPair[0] >= 4) {
                                TData.RS4.EEPROMPortPair[0] = 0;
                            }
                        } else {
                            Uart_BuildReqWISData(0);                //WIS data
                        }
                        break;
                    default:
                        Uart_BuildReqWISData(0);                //WIS data
                        break;
                    }
                    break;
                case 0x02: // Radar??
                    switch (SeqCnt) {
                    case 20:
                        if ((TData.RS4.FromTargetBuffer[0][0] == false) && (TData.RS4.EEPROMPortPair[0] == PortPair)) { // buffer ready
                            if (++TData.RS4.EEPROMPortPair[0] >= 4) {
                                TData.RS4.EEPROMPortPair[0] = 0;
                            }
                        }
                        // Fall through and send the request
                    default:
                        Uart_BuildReqRadarData(0);          // Radar data
                        break;
                    case 0:
                        Uart_BuildReqRadarInfo(0);          //Radar Information
                        break;
                    }
                    break;
                case 0x00:  // AN-SGCNV
                    if ((TData.RS4.ToTargetBuffer[0][0] == true) && // Data ready for this AD card
                        (TData.RS4.ToTargetBuffer[0][1] == PortPair)) {
                        Uart_BuildSndData(0);                       // add data to AD card package
                        Uart_BuildReqConfig(0);                 //Config data, cmd 17
                        AskMD = false;
                    } else {
                        AskMD = true;
                    }
                    if (SeqCnt == 0) {
                        Uart_BuildReqCardStatus(0);             //Card status, cmd 27
                    } else if (SeqCnt == 5) {
                        Uart_BuildReqR16552(0);                 //Raw data, cmd 13
                    } else if (SeqCnt == 10) {
                        Uart_BuildReqConfig(0);                 //Config data, cmd 17
                    } else if (SeqCnt == 15) {
                        Uart_BuildReqC16552(0);                 //Cal data, cmd 16
                    } else if (SeqCnt == 20) {
                        if ((TData.RS4.FromTargetBuffer[0][0] == false) && (TData.RS4.EEPROMPortPair[0] == PortPair)) { // buffer ready
                            Uart_BuildReqEEPROMData(0);             //EEpromdata cmd, 24
                            if ((TData.RS4.EEPROMADChannel[0] += 2) > 14) { //Next channel
                                TData.RS4.EEPROMADChannel[0] = 0;
                                if (++TData.RS4.EEPROMPortPair[0] >= 4) {
                                    TData.RS4.EEPROMPortPair[0] = 0;
                                }
                            }
                        } else if (AskMD == true) {
                            Uart_BuildReqM16552(0);                 //Measure data, cmd 10
                        }
                    } else if (AskMD == true) {
                        Uart_BuildReqM16552(0);                 //Measure data, cmd 10
                    }
                    break;
                }
                Uart_BuildTail16552(0);
            } else {
                if (TData.RS4.EEPROMPortPair[0] == PortPair) {
                    if (++TData.RS4.EEPROMPortPair[0] >= 4) {  // make sure that the EEPROM reading is not stopped
                        TData.RS4.EEPROMPortPair[0] = 0;
                    }
                }
            }
        if (++SeqCnt > 20) {              //  all request within 20 x 2 sec.
            SeqCnt = 0;
        }

