ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/RS485Alt1.c
}
/*************************************************************************
*
*  Check action on received data from AN_SGCNV
*
*************************************************************************/
char CheckActionUart16552(char ch, unsigned short pointer) {

    char retval = true;
    char Cmd = UART16552[ch].pRxBuffer[pointer];
    switch (Cmd) {    // check action
    case ANP1_REP_MP_DATA :                              // Measured pressure data
    case ANP1_REP_MT_DATA :                              // Measured temperature data
    case ANP1_REP_MO_DATA :                              // Measured "other" data
        ReceivePTOData(ch, pointer + 2);                     // receive package
        break;
    case ANP1_REP_WH_DATA :                              // Measured "washtrack and high level" data
        ReceiveWHData(ch, pointer + 2);                     // receive package
        break;
    case ANP1_REP_RP_DATA :                              // Raw pressure data
    case ANP1_REP_RT_DATA :                              // Raw temp. data
    case ANP1_REP_RO_DATA :                              // Raw "other" data
        ReceiveRData(ch, pointer + 2);              // receive package
        break;
    case ANP1_REP_CAL_DATA :                             // Raw "other" data
        ReceiveCData(ch, pointer + 2);              // receive package
        break;

    case ANP1_REP_CARD_STAT :                             // card status package
        ReceiveCardStatus(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_CONFIG :                             // config data
        ReceiveConfigData(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_EEP_DATA :                             // card eeprome
        ReceiveCardEEPROMData(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_WIS_STAT :                             // Card status from WIS
        ReceiveWISStatus(ch, pointer + 2);            // receive package
        break;

    case ANP1_REP_WIS_XDATA :                             // Card WIS protocol
        ReceiveWISXData(ch, pointer + 2);            // receive package
        break;

    case ANP1_REP_WIS_DATA :                             // Data from WIS
        ReceiveWISData(ch, pointer + 2);             // receive package
        break;
    case ANP1_REP_GODA_DATA:
        ReceiveRadarData(ch, pointer + 2);             // receive package
        break;
    case ANP1_REP_GODA_INFO:
        ReceiveRadarInfo(ch, pointer + 2);             // receive package
        break;
    case ANP1_ECMD_NMDRQACK :                             // No more data, send ack.
    case ANP1_ECMD_NMDWOACK :                         // No more data
        retval = false;
        break;
    }
    return retval;
}

/*************************************************************************
*   
*  Handle the ANPRO10 protocol
* 
*  Returns 1 if a reply has been sent
*
*************************************************************************/
char ANPRO1_UnpackPacket(char ch) {
    unsigned  pointer = 4;
    char Cmd = UART16552[ch].pRxBuffer[pointer];        // check action
    char retval = true;
    switch (Cmd) {    // check action
    case ANP1_REP_MP_DATA :                              // Measured pressure data
    case ANP1_REP_MT_DATA :                              // Measured temperature data
    case ANP1_REP_MO_DATA :                              // Measured "other" data
        ReceivePTOData(ch, pointer + 2);                     // receive package
        break;
    case ANP1_REP_WH_DATA :                              // Measured "washtrack and high level" data
        ReceiveWHData(ch, pointer + 2);                     // receive package
        break;
    case ANP1_REP_RP_DATA :                              // Raw pressure data
    case ANP1_REP_RT_DATA :                              // Raw temp. data
    case ANP1_REP_RO_DATA :                              // Raw "other" data
        ReceiveRData(ch, pointer + 2);              // receive package
        break;
    case ANP1_REP_CAL_DATA :                             // Raw "other" data
        ReceiveCData(ch, pointer + 2);              // receive package
        break;

    case ANP1_REP_CARD_STAT :                             // card status package
        ReceiveCardStatus(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_CONFIG :                             // config data
        ReceiveConfigData(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_EEP_DATA :                             // card eeprome
        ReceiveCardEEPROMData(ch, pointer + 2);          // receive package
        break;

    case ANP1_REP_WIS_STAT :                             // Card status from WIS
        ReceiveWISStatus(ch, pointer + 2);            // receive package
        break;

    case ANP1_REP_WIS_XDATA :                             // Card WIS protocol
        ReceiveWISXData(ch, pointer + 2);            // receive package
        break;

    case ANP1_REP_WIS_DATA :                             // Data from WIS
        ReceiveWISData(ch, pointer + 2);             // receive package
        break;
    case ANP1_REP_GODA_DATA:
        ReceiveRadarData(ch, pointer + 2);             // receive package
        break;
    case ANP1_REP_GODA_INFO:
        ReceiveRadarInfo(ch, pointer + 2);             // receive package
        break;
    case ANP1_ECMD_NMDRQACK :                             // No more data, send ack.
    case ANP1_ECMD_NMDWOACK :                         // No more data
        retval = false;
        break;
    }
    return retval;
}


char ANPRO1_IO_Receive(int Ch, UARTDataType *UART16552Ptr) {
    char *RxBuf = UART16552Ptr->pRxBuffer;
    const ANPRO1_PacketHeading *pPH =  (ANPRO1_PacketHeading *)RxBuf;
    OS_MAILBOX *RxMailBoxPtr = &UART16552Ptr->RxMailBox;
    char Data;
    char dataAvailable = 1;
    int  SyncCnt       = 1;     // Initialize to 1 as 1 must have been found when exiting the while loop
    char PacketOK      = false; // Assume the worse at the beginning

    //memset(RxBuf,0,RXSIZE_UART);
    char Echo          = false;
    do {
        do {
            dataAvailable = !OS_GetMailTimed(RxMailBoxPtr, &Data, 200); // Wait for the response from ANSGCNV
            //WriteByte(Data&0xFF);
        }  while (dataAvailable && Data != ANPRO1_SYN);
        if (dataAvailable) {
            // We have received sufficent SYNC
            // A minimum of 2 SYN to accept start
            //Message("First SYN");
            do {
                dataAvailable = !OS_GetMailTimed(RxMailBoxPtr, &Data, MAX_TIME_BETWEEN_BYTE);
                if (dataAvailable && (Data == ANPRO1_SYN)) SyncCnt++;
            } while (dataAvailable && (Data == ANPRO1_SYN));
            if (dataAvailable && SyncCnt>= 2) {
                // We allready have one byte of the heading. Move it to the RxBuffer and
                // receive the rest of the heading
                char *RxPtr = RxBuf;
                RxBuf[0] = Data;
                RxPtr++;
                for (unsigned i = 1; dataAvailable && i < sizeof(ANPRO1_PacketHeading); i++) {
                    dataAvailable = !OS_GetMailTimed(RxMailBoxPtr, &Data, MAX_TIME_BETWEEN_BYTE);
                    if (dataAvailable) {
                        *RxPtr++ = Data;
                    }
                }
                if (dataAvailable) {
                    unsigned DataSize = (pPH->HiSize << 8) | pPH->LoSize;
                    if (DataSize > 3 && DataSize < RXSIZE_UART) {
                        for (unsigned i = 0; dataAvailable && i < DataSize - sizeof(ANPRO1_PacketHeading); i++) {
                            dataAvailable = !OS_GetMailTimed(RxMailBoxPtr, &Data, MAX_TIME_BETWEEN_BYTE);
                            if (dataAvailable) {
                                *RxPtr++ = Data;
                            }
                        }
                        if (dataAvailable) {
                            char EOTByte = *((char *)&RxBuf[DataSize - 1]);
                            if (EOTByte == ANPRO1_EOT) {
                                RxPtr = RxBuf;
                                char CSum = 0;
                                for (unsigned i = 0; i < DataSize - 2; i++) {
                                    CSum     = crc[CSum ^ *RxPtr++];
                                }
                                char  PacketCheckSum = *((char *)&RxBuf[DataSize - 2]);
                                if (PacketCheckSum == CSum) {
                                    if (pPH->TxAddress != MY_SGCNV_ADDR) {
                                        Usart16552CheckPackage(Ch);
                                        PacketOK = true; // Packet accepted so signal OK!
                                        Echo = false;
                                    } else {
                                        Echo = true;
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }while (Echo && dataAvailable);
    return PacketOK;
}


/*************************************************************************
*   (This is a task)
*  Usart handler UART receive data
*
*************************************************************************/
void ExtRS485Rec(void *pVoid) {
    char Ch = (int)pVoid;
    UARTDataType *UART16552Ptr = &UART16552[Ch];
    Init16552(Ch, 9600);   // Init UART channel 
    
    SetBit(EIMSK , __BIT_MASK(Ch));            // External interrupt mask register, int on

    OS_Delay(UART_START_DELAY + 800);           // Waiting for target startup and power on sequence

    while (1) {
        char RS485Channel = PortPair + 4 * Ch;
        char EventStatus = OS_WaitEventTimed(0x01, 1000);              // Wait for TxComplete
        //EmptyRxBuf16552(Ch);
        char PacketOk = ANPRO1_IO_Receive(Ch, UART16552Ptr);  // handle incomming package

        if (PacketOk) {                  // answer on ch 0
            TData.RS4.FailCnt[RS485Channel][0] = 0; // Reset counter
            TData.RS4.IOUnitStatus[RS485Channel] &= ~COMFAIL_BIT; // No error
            UART16552Ptr->RxFaultCnt = 0;          // OK package on 16552 channel
        } else {
            UART16552Ptr->RxFaultCnt++;          // Fault in package on 16552 channel
            TData.RS4.FailCnt[RS485Channel][1]++;      // no answer total counter
            if (TData.RS4.FailCnt[RS485Channel][0]++ > FAILCNT_ERROR) {
                TData.RS4.IOUnitStatus[RS485Channel] |= COMFAIL_BIT;      // report fault
            }
            if ((TData.RS4.PortUsed >> RS485Channel) & 0x01) {              // sensor on port 0?
                if ((TData.RS4.FailCnt[RS485Channel][0] & 0x0007) == 0x0004) {   //check if powqer shall be switched off
                    // volatile undefined behavior
                    // ClrBit(PORTC, (0x01 << PortPair));            // Switch off power
                    //
                    //ClrBit(PORTC, 0x01 << PortPair);            // Switch off power
                }
            }
        }
        OS_SignalEvent(1 << Ch, &TCB_RS485Ctl);
    }
}

/*************************************************************************
*
*  Set ports on or off
*
*************************************************************************/
void SetRS4Port(void) {

    PORTC = TData.RS4.PortUsed;

