ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/RS485Alt1.c
}

/*************************************************************************
*
* Build send request for system status on AN_SGCNV
*
*************************************************************************/
void Uart_BuildReqCardStatus(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_CARD_STAT;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                 /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*data */

}

/*************************************************************************
*
* Build send request for card config on AN_SGCNV
*
*************************************************************************/
void Uart_BuildReqConfig(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_CONFIG;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 0;                 /*nob */

}

/*************************************************************************
*
* Build send request for EEPROM data on AN_SGCNV
*
*************************************************************************/
void Uart_BuildReqEEPROMData(char ch) {

    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = ANP1_REQ_EEP_DATA;       /*command, send data */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = 1;                 /*nob */
    UART16552[ch].pTxBuffer[UART16552[ch].TxFirst++] = TData.RS4.EEPROMADChannel[ch];       /*data */

}

/*************************************************************************
*
* Calculate tx checksum for Dallas Semiconductor one-wire CRC
*
*************************************************************************/
char CalcDSTxChecksumUART16552(char ch, unsigned short len) {

    unsigned short cnt;
    unsigned char csum;

    csum = 0;
    for (cnt = 2; cnt < len; cnt++) {
        csum = crc[csum ^ UART16552[ch].pTxBuffer[cnt]];
    }
    return csum;
}

/*************************************************************************
*
* Calculate rx checksum for Dallas Semiconductor one-wire CRC
*
*************************************************************************/
short CalcDSRxChecksum16552(char ch) {

    short cnt;
    unsigned char csum;

    csum = 0;
    for (cnt = 0; cnt < (UART16552[ch].RxPacklen - 2); cnt++) {
        csum = crc[csum ^ UART16552[ch].pRxBuffer[cnt]];
    }
    if (csum == UART16552[ch].pRxBuffer[UART16552[ch].RxPacklen - 2]) {
        return true;
    } else {
        return false;
    }
}

/*************************************************************************
*
*  Empty rx buffer on PC16552 UART
*
*************************************************************************/
void EmptyRxBuf16552(char uartno) {

    switch (uartno) {
    case 0:
        do {
            U0_RBR;
        } while (U0_LSR & DATA_READY);
        break;
    case 1:
        do {
            U1_RBR;
        } while (U1_LSR & DATA_READY);
        break;
    }
}

/*************************************************************************
*
*  Init the PC16552 UART
*
*************************************************************************/
void Init16552(char channel, unsigned long baud) {
    // Create mailbox
    OS_CreateMB(&UART16552[channel].RxMailBox, 1, MBUF_SIZE, &UART16552[channel].MailBuf);
    /*--- Configure UART data block ---*/
    UART16552[channel].TxFirst = 0x00;
    UART16552[channel].TxLast = 0x00;
    UART16552[channel].TxCount = 0x00;
    UART16552[channel].RxCount = 0x00;
    UART16552[channel].TxStatus = 0x00;
    //char Test = *ExtIntID;
    switch (channel) {
    case 0x00 :
        UART16552[channel].RxTimeout = RX_TO_TIME;   // reset timeout
        U0_LCR = 0x80;          // set DLAB
        U0_DLL = ((XTAL_CPU / 8 / 16 / baud) & 0xff);
        U0_DLM = (((XTAL_CPU / 8 / 16 / baud) >> 8) & 0xff);
        U0_LCR = 0x03;          // reset DLAB and set 8,n,1
        U0_FCR = 0x01;          // enable FIFO ..
        U0_FCR = 0xC1;          // and set RXLevel to 8=0x81, 14 = 0xC1
        U0_IER = 0x03;          // enable TX and RX int.
        U0_MCR = 0x00;          // RTS off
        break;
    case 0x01 :
        UART16552[channel].RxTimeout = RX_TO_TIME;   // reset timeout
        U1_LCR = 0x80;          // set DLAB
        U1_DLL = ((XTAL_CPU / 8 / 16 / baud) & 0xff);
        U1_DLM = (((XTAL_CPU / 8 / 16 / baud) >> 8) & 0xff);
        U1_LCR = 0x03;          // reset DLAB and set 8,n,1
        U1_FCR = 0x01;          // enable FIFO ..
        U1_FCR = 0xC1;          // and set RXLevel to 8=0x81, 14 = 0xC1
        U1_IER = 0x03;          // enable TX and RX int.
        U1_MCR = 0x00;          // RTS off
        break;
    default:
        break;
    }
}

#if USE_MODBUS_PROTOCOL == 1
static unsigned short  Rsp_Delay[2];       // response delay

static void
load_eeprom_misc_485(void) {
    char ch;
    uint16_t temp;

    for (ch = 0; ch < 2; ch++) {
        ReadEEPROMBuffer(EEPROM_PORTSETUP + 3 + ch * 2, sizeof(uint16_t), (char *)&temp);

        if (temp > 0 && temp <= 5000) {
            Rsp_Delay[ch] = temp;
        } else {
            Rsp_Delay[ch] = 0;
        }
    }
}

static void
__rs485_task_set_power(uint8_t ch, uint8_t on) {
    uint8_t current;

    current = (TData.RS4.PortUsed >> ch) & 0x01;

    if (current == on) {
        // no need to waste time
        return;
    }

    if (on) {
        TData.RS4.PortUsed |= (1 << ch);
    } else {
        TData.RS4.PortUsed &= ~(1 << ch);
    }
    PORTC = TData.RS4.PortUsed;

    WriteEEPROMByte(EEPROM_PORTSETUP, TData.RS4.PortUsed);
}

void
rs485_task_set_power(uint8_t ch, uint8_t on) {
    OS_Use(&UARTSEND);
    __rs485_task_set_power(ch, on);
    OS_Unuse(&UARTSEND);
}

uint8_t
rs485_task_get_power(uint8_t ch) {
    uint8_t status;

    OS_Use(&UARTSEND);
    status = (TData.RS4.PortUsed >> ch) & 0x01;
    OS_Unuse(&UARTSEND);

    return status;
}

uint8_t
rs485_task_get_sensor_type(uint8_t ch) {
    uint8_t sensor_type;

    OS_Use(&UARTSEND);
    sensor_type = (TData.RS4.SensorType[ch / 4] >> (2 * (ch % 4))) & 0x03;
    OS_Unuse(&UARTSEND);

