ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/RS485Alt1.c
    return sensor_type;
}

void
rs485_task_set_sensor_type(uint8_t ch, uint8_t sensor_type) {
    OS_Use(&UARTSEND);

    // clear first
    TData.RS4.SensorType[ch / 4] &= ~(0x03 << ((ch % 4) * 2));

    // set
    TData.RS4.SensorType[ch / 4] |= ((sensor_type & 0x03) << ((ch % 4) * 2));

    WriteEEPROMByte(EEPROM_PORTSETUP + 1, TData.RS4.SensorType[0]);
    WriteEEPROMByte(EEPROM_PORTSETUP + 2, TData.RS4.SensorType[1]);

    OS_Unuse(&UARTSEND);
}

static void
__rs485_task_set_rsp_delay(uint8_t port, uint16_t delay) {
    uint16_t cur_delay = Rsp_Delay[port];

    if (cur_delay == delay) {
        return;
    }

    if (delay > 5000) {
        return;
    }

    Rsp_Delay[port] = delay;

    WriteEEPROMBufferSync(EEPROM_PORTSETUP + 3 + port * 2, sizeof(uint16_t), (char *)&delay);
}

void
rs485_task_set_rsp_delay(uint8_t port, uint16_t delay) {
    OS_Use(&UARTSEND);
    __rs485_task_set_rsp_delay(port, delay);
    OS_Unuse(&UARTSEND);
}

uint16_t
rs485_task_get_rsp_delay(uint8_t port) {
    uint16_t    ret;

    OS_Use(&UARTSEND);
    ret = Rsp_Delay[port];
    OS_Unuse(&UARTSEND);

    return ret;
}

uint8_t
rs485_task_get_comm_status(uint8_t port) {
    uint16_t    ret;

    // XXX no need for lock
    ret = (TData.RS4.IOUnitStatus[port] & COMFAIL_BIT) ? 0 : 1;

    return ret;
}

uint8_t
rs485_task_get_channel_status(uint8_t port, uint8_t ch) {
    uint8_t ret;

    OS_Use(&UARTSEND);
    ret = (uint8_t)TData.RS4.TargetSetup1[port][ch];
    OS_Unuse(&UARTSEND);

    return ret;
}

int16_t
rs485_task_get_channel_value(uint8_t port, uint8_t ch) {
    float f;
    int16_t  ret;

    OS_Use(&UARTSEND);
    f = TData.RS4.Result[port][ch];
    OS_Unuse(&UARTSEND);

    ret = (int16_t)(f * 100);
    return ret;
}

int16_t
rs485_task_get_channel_raw_value(uint8_t port, uint8_t ch) {
    int16_t ret;

    OS_Use(&UARTSEND);
    ret = TData.RS4.Raw[port][ch];
    OS_Unuse(&UARTSEND);

    return ret;
}

int16_t
rs485_task_get_channel_cal_value(uint8_t port, uint8_t ch) {
    int16_t ret;

    OS_Use(&UARTSEND);
    ret = TData.RS4.Cal[port][ch];
    OS_Unuse(&UARTSEND);

    return ret;
}
#endif /* USE_MODBUS_PROTOCOL == 1 */

